// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	
	АктивноеОкно = АктивноеОкно();
	Если АктивноеОкно <> Неопределено Тогда
		Для Каждого ЭлементОкна Из АктивноеОкно.Содержимое Цикл
			Если ТипЗнч(ЭлементОкна) = Тип("ФормаКлиентскогоПриложения") Тогда
				ПараметрыФормы.Вставить("ИдентификаторТекущейФормы", ЭлементОкна.УникальныйИдентификатор);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ПОФ_ПереключательОткрытыхФорм.Форма.Форма", 
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти
